# ML _ Prediction Model_ Using Naive Bayes _survival Prediction in Titanic Dataset

In [19]:
import pandas as pd
df=pd.read_csv('C:\\Users\\user\\Documents\\PythonPractiseFiles\\titanic data set\\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace= True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [21]:
target = df.Survived

In [22]:
inputs = df.drop('Survived',axis= 'columns')

In [23]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [24]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [25]:
#dropping 'Sex' and 'Male ' columns because only 'Female column can indicate all values 
inputs.drop(['Sex','male'],axis = 'columns',inplace = True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [26]:
#Checking for NA Values
inputs.columns[inputs.isna().any()]
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [31]:
#using fillna command filling all the NA values

inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [32]:
#Spliting the data into 80: 20 
from sklearn.model_selection import train_test_split      
X_train,X_test,Y_train,Y_test, = train_test_split(inputs,target,test_size = 0.2)

In [34]:
len(X_train)

712

In [35]:
len(X_test)

179

In [36]:
from sklearn.naive_bayes import GaussianNB #importing Gaussian NB which is used for bell curve
model = GaussianNB()

In [37]:
model.fit(X_train,Y_train)    # trainig the 80 % data from naive bayes model

GaussianNB()

In [38]:
model.score(X_test,Y_test)

0.7653631284916201

In [39]:
X_test[:10]

     Pclass        Age     Fare  female
590       3  35.000000   7.1250       0
351       1  29.699118  35.0000       0
43        2   3.000000  41.5792       1
711       1  29.699118  26.5500       0
284       1  29.699118  26.0000       0
696       3  44.000000   8.0500       0
532       3  17.000000   7.2292       0
595       3  36.000000  24.1500       0
720       2   6.000000  33.0000       1
540       1  36.000000  71.0000       1

In [40]:
Y_test[:10]

590    0
351    0
43     1
711    0
284    0
696    0
532    0
595    0
720    1
540    1
Name: Survived, dtype: int64

In [41]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 1, 1], dtype=int64)

In [42]:
model.predict_proba(X_test[:10])

array([[0.96634333, 0.03365667],
       [0.75623432, 0.24376568],
       [0.084571  , 0.915429  ],
       [0.77213026, 0.22786974],
       [0.77287086, 0.22712914],
       [0.9663998 , 0.0336002 ],
       [0.95426943, 0.04573057],
       [0.96590336, 0.03409664],
       [0.10729998, 0.89270002],
       [0.02747302, 0.97252698]])

# Here we can see that in first row the prob of no survival is 96% and of survival is 4% hence it is considered as '0' means not survived